Tekla.Structures.Model.Internal.ExcelReportData
Excel report data structure.

Tekla.Structures.Model.Internal.ExcelReportData.DataFileName
The name of the report template (rpt).

Tekla.Structures.Model.Internal.ExcelReportData.OutputFilePath
The path to the output file.

Tekla.Structures.Model.Internal.ExcelReportData.Title1
The first title of the report.

Tekla.Structures.Model.Internal.ExcelReportData.Title2
The second title of the report.

Tekla.Structures.Model.Internal.ExcelReportData.Title3
The third title of the report.

Tekla.Structures.Model.Internal.ExcelReportData.OnlySelected
1 for only selected objects, 0 for all objects.

Tekla.Structures.Model.Internal.ExcelReportData.OpenAfterCreate
1 for opening the report after creation, 0 for not opening.